const admin = require("firebase-admin");
const serviceAccount = require("./serviceAccountKey.json");

admin.initializeApp({
  credential: admin.credential.cert(serviceAccount)
});

const db = admin.firestore();

const clients = {
  "100001": {
    "顧客コード": "100001",
    "氏名": "山田　太郎",
    "カナ": "ﾔﾏﾀﾞ ﾀﾛｳ",
    "電話番号": "090-○○○○-○○○○",
    "住所": "千葉県千葉市稲毛区稲毛1-1-1"
  },
  "100002": {
    "顧客コード": "100002",
    "氏名": "山田　次郎",
    "カナ": "ﾔﾏﾀﾞ ｼﾞﾛｳ",
    "電話番号": "080-○○○○-○○○○",
    "住所": "東京都新宿区西新宿二丁目8番1号"
  },
  "100003": {
    "顧客コード": "100003",
    "氏名": "山田　三郎",
    "カナ": "ﾔﾏﾀﾞ ｻﾌﾞﾛｳ",
    "電話番号": "070-○○○○-○○○○",
    "住所": "埼玉県さいたま市浦和区前地１丁目１−１"
  }
};

// [
//  {
//    "顧客コード": 100001,
//    "氏名": "山田　太郎",
//    "カナ": "ﾔﾏﾀﾞ ﾀﾛｳ",
//    "電話番号": "090-○○○○-○○○○",
//    "住所": "千葉県千葉市稲毛区稲毛1-1-1"
//  },
//  {
//    "顧客コード": 100002,
//    "氏名": "山田　次郎",
//    "カナ": "ﾔﾏﾀﾞ ｼﾞﾛｳ",
//    "電話番号": "080-○○○○-○○○○",
//    "住所": "東京都新宿区西新宿二丁目8番1号"
//  },
//  {
//    "顧客コード": 100003,
//    "氏名": "山田　三郎",
//    "カナ": "ﾔﾏﾀﾞ ｻﾌﾞﾛｳ",
//    "電話番号": "070-○○○○-○○○○",
//    "住所": "埼玉県さいたま市浦和区前地１丁目１−１"
//  }
// ];

(async () => {
  for (const [id, data] of Object.entries(clients)) {
    await db.collection("client").doc(id).set(data);
    console.log(`Document ${id} written`);
  }
})();
